/**************************************************************************************************************
Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
Решаем с помощью "/" и "%", со строками не работаем
456 -> 5
782 -> 8
918 -> 1
****************************************************************************************************************/

Console.WriteLine ("Введите трехзначное число");
int Number = int.Parse(Console.ReadLine()!);

if ((Number > 99) && (Number < 1000)){
    int result = Number / 10 % 10;
    Console.WriteLine ($"Вторая цифра в числе {Number} -> {result}");
}
else {
    Console.WriteLine ("Введено не трехзначное число");
}
