/**************************************************************************************************************
Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
Решаем с помощью "/" и "%", со строками не работаем
456 -> 5
782 -> 8
918 -> 1
****************************************************************************************************************/
/*
Console.WriteLine ("Введите трехзначное число");
int Number = int.Parse(Console.ReadLine()!);

if (Number > 99 && Number < 1000){
    int result = Number / 10 % 10;
    Console.WriteLine ($"Вторая цифра в числе {Number} -> {result}");
}
else {
    Console.WriteLine ("Введено не трехзначное число");
}
*/
/**************************************************************************************************************
Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
что третьей цифры нет. Решаем с помощью "/" и "%", со строками не работаем (Максимальное число 100000)
645 -> 5
78 -> третьей цифры нет
32679 -> 6
****************************************************************************************************************/

Console.WriteLine ("Введите трехзначное число");
int Number = int.Parse(Console.ReadLine()!);

if (Number < 100){
    Console.WriteLine ($"В числе {Number} третьей цифры нет");
    return;
}
if (Number > 100000){
    Console.WriteLine ($"Число {Number} не соответствует условиям задачи");
    return;
}
int ThirdNumber = 0;
if (Number > 99 && Number < 1000) {
    ThirdNumber = (Number % 100) % 10;
}
if (Number > 999 && Number < 10000) {
    ThirdNumber = (Number % 100) / 10;
}
if (Number > 9999 && Number < 100000) {
    ThirdNumber = (Number % 1000) / 100;
}
Console.WriteLine ($"Третья цифра числа {Number} -> {ThirdNumber}");